{"data":{"wordpressPost":{"title":"Website Making: Part&nbsp;1","content":"<div dir=\"ltr\" style=\"text-align:left;\"><span style=\"font-family:comic sans ms;\">Hello! This is gonna be really exciting to describe. 3 weeks ago, our computer tutorial ma&#8217;am had asked two boys to get ready for making a website. Unfortunately, she didn&#8217;t ask me. I didn&#8217;t know much about HTML coding and other stuff then, but I still had the interest of doing it. And, that naturally saddened me a bit. I tried to forget it as much as possible, but it stayed on my mind. Finally, one day when I was entering the computer laboratory in my school, the same ma&#8217;am (who also teaches in our school), and our two other teachers were discussing something.<!--more--> I had incidentally entered first on that day. Suddenly, ma&#8217;am looked up and said something to the other two teachers. I became a bit hopeful, although not expecting much. Quite surprisingly, as everyone came to the lab, she asked us to sit quietly as she would be making an announcement. We all followed. Then came the news. She said that on that day, she would be making choices and even asking us to start working on a new website for the inter-school competition that would be occurring during our school fest (that was just 10 days away). The first person she chose was me!!! I held on to my excitement firmly, as she asked me if I would like to participate. Calmly, that is as calmly as possible, I said &#8220;Yes ma&#8217;am&#8221;, and nodded my head. Next she chose the first boy of our class. We were made a team 🙂 Then, as the class started, she gave us a page which contained all the instructions for the competition and the guidelines and of course, the topic: Bengali films. The thing is that I don&#8217;t really remember the original topic, but the idea was to make a Bengali films timeline showing the transition of Bengali films from the old times, to the modern times, laying stress on the three legendary directors: Satyajit Ray, Mrinal Sen and Ritwik Ghatak. Anyway, ma&#8217;am asked me if I knew a bit of HTML coding to start with. The truth was that at that time I knew very little: only how to include text in a webpage 😛 Still, I said yes.<br />\nAs the class ended and we went back to our classroom, I started discussing with Avirup (my team-mate) the plan. He added newer ideas, and then we finally decided what the different pages would be: a timeline, the three contemporary legends, directors, actors and actresses, a video collection, a photo collection, a review page, and an interactive quiz. We sort of decide how the home page was at that time, but later I changed it. Anyway, I told him that I would create the home page on that day and the next day I would be bringing it in school. Thus, the project started&#8230;the project that was quite a sort of dream to me. And, believe me, I never thought that I would ultimately be able to finish it. I visualized the pages in my head, but like my previous school project: a shopping application in Java(my first application), I only assumed that the thing would somehow be done&#8230;I had no idea HOW it would be done&#8230;<br />\n</span></p>\n<hr />\n<p style=\"text-align:justify;\"><span style=\"font-family:comic sans ms;\">        That evening after I went home, I connected my laptop to the internet, and started searching for a complete HTML tutorial for beginners. I never found a good one, but ultimately I found a site that provided a good tutorial. I knew of one from before called w3schools.com, but it was a bit vague. The other site was good enough. I searched for a good HTML editing software, but found none. So I started coding in notepad. I finished creating the first layout of my homepage after an hour! There was so much to learn. Although it was pleasing, it didn&#8217;t yet have the real content. I changed fonts, backgrounds, but, still the main links and contents were missing, and my conception was still hollow. I continued this &#8216;researching&#8217; till 2 AM, but still hadn&#8217;t made much progress with my homepage. Too tired to continue any more, I fell asleep.<br />\nNext day, in the morning, I again coded a bit. I had a holiday on that day. I did a bit of my school studies, but not much. I studied HTML on my laptop mostly that day. At night, I was beginning to worry. I still hadn&#8217;t made the links. The trouble was that I didn&#8217;t know how to include soft buttons, like the ones modern webpages have. </span></p>\n<div style=\"text-align:justify;\"><span style=\"font-family:'comic sans ms';\">        Then, luck struck me! I was looking at various websites, when suddenly I saw one which had those soft buttons, and quite suddenly like a brainwave, the idea of how to make the buttons struck me too! I was simultaneously chatting with Avirup on Facebook&#8230;on discovering how to do it, i started typing gibberish in my chat box. Avirup said, &#8220;pagol holi naki?&#8221; As if screaming, I wrote in caps: BUJHTE PERECHI!!! ETO SIMPLE JINISH TA MATHAAY ASHCHILO NA!!!</span></div>\n<div><span style=\"font-family:comic sans ms;\">        Using Photoshop, I created buttons, and using Picasa, I included the text that was supposed to be on the buttons. The logic for highlighting the buttons whenever the user would move his/her mouse over it was simple: on detecting the mouse, the image for the button would simply change, in other words, a new image would replace the old one with a new colour, and on moving the mouse away, the old image would be restored! Thus, my &#8216;soft buttons&#8217; were ready for use! I made 8 buttons in Photoshop that night, and by 3 AM, the home page was ready: a nice textured black background, a heading on the top of the page, then the 8 buttons, a small description, a picture of the three legendary directors, and finally a footer: a copyrighted name (The Bengali Films Timeline), the year, and links to the about us and contact us pages. After saving it, I went to sleep&#8230;the next day, Avirup was really delighted, and he constantly said, &#8220;Government website hoyni ekdom!&#8221; Our government department websites have a poor layout. That&#8217;s what he didn&#8217;t want to happen to our website. I knew that he was pleased too&#8230;:) Thus, the first challenge ended. Although my concepts about websites were not 100% clear, I got the idea of how to design a basic, yet complete webpage.</span><br />\n<span style=\"font-family:comic sans ms;\"><br />\n</span></p>\n<div class=\"separator\" style=\"clear:both;text-align:justify;\">\n<figure style=\"width: 502px\" class=\"wp-caption aligncenter\"><a style=\"margin-left:1em;margin-right:1em;\" href=\"http://nabhoneelparchments.files.wordpress.com/2012/12/fa877-web1.jpg\"><img src=\"https://nabhoneelparchments.files.wordpress.com/2012/12/fa877-web1.jpg?w=502&#038;h=473\" alt=\"\" width=\"502\" height=\"473\" border=\"0\" /></a><figcaption class=\"wp-caption-text\">The Home Page</figcaption></figure>\n</div>\n<div class=\"separator\" style=\"clear:both;text-align:justify;\"> Continued on: &#8216;<a title=\"Website making: Part 2\" href=\"http://nabhoneelparchments.wordpress.com/2012/12/19/website-making-part-2/\">Website making: Part 2</a>&#8216;</div>\n<p style=\"text-align:justify;\"><span style=\"font-family:comic sans ms;\"> </span></p>\n</div>\n</div>\n","date":"2012-12-17T09:51:00.000Z","slug":"website-making-part-1","excerpt":"<p>I only assumed that the thing would somehow be done&#8230;I had no idea HOW it would be done&#8230;</p>\n","jetpack_featured_media_url":""},"site":{"siteMetadata":{"title":null,"subtitle":null}}},"pageContext":{"id":"3fac2489-1677-524e-bbaa-fbb6212106d2"}}