{"data":{"wordpressPost":{"title":"Swimming Alone&#8230;","content":"<div dir=\"ltr\" style=\"text-align:justify;\"></div>\n<div dir=\"ltr\" style=\"text-align:justify;\"><a href=\"https://nabhoneelparchments.files.wordpress.com/2013/04/img_0066.jpg\"><img class=\"aligncenter size-large wp-image-670\" src=\"https://nabhoneelparchments.files.wordpress.com/2013/04/img_0066.jpg?w=660\" alt=\"IMG_0066\" width=\"660\" height=\"371\" /></a></div>\n<div dir=\"ltr\" style=\"text-align:justify;\"></div>\n<div dir=\"ltr\" style=\"text-align:justify;\"><span style=\"font-family:Trebuchet MS, sans-serif;\"><i>It was the last day of our 4 day trip to Shantiniketan. The day was gloomy from the time the very first rays of the sun hit our house. First of all, the night before had not gone as expected. I was not able to spend much time with my sister or my parents. It was mostly boring, apart from the period between 9:30 pm to 10:00 pm, when I strolled around in the compound of Aamar Bari, listening to music, and occasionally talking to my friends. Thus, the next day, I was  thinking of how to spend the remaining 3 hours. <!--more-->Then, my parents suggested to go swimming! I was already a bit tired, but still I took my towel, clothes on my bicycle, and cycled off towards the swimming people&#8230;from a distance, I realized the water was absolutely calm, and NO ONE WAS THERE!!! I parked my cycle near the pool, took off my shirt, and just jumped in. It was a wee bit colder than the normal temperature, whereas the previous day it was probably perfect because we had gone swimming in the evening, and the sun had already warmed the waters by then. I took a deep breathe, and started a free style stroke. After completing four rounds, I stopped. Then, I was acclimatized! 🙂 I then frog-styled and moved about the whole pool for relaxing. For perhaps the next 30 minuted, I did the various strokes I know. I practiced underwater from one end of the pool to the other as well. Then, the weather came to my favour&#8230;</i></span><br />\n<i><span style=\"font-family:Trebuchet MS, sans-serif;\"><br />\n</span><span style=\"font-family:Trebuchet MS, sans-serif;\">The sun came out of the clouds, and sparkled the water! This was my all-time dream while swimming, something I couldn&#8217;t enjoy in the city. I immediately took a deep breathe and moved below the surface of the water. The sight immediately pleased me and made me forget about all other worries. The floor of the swimming pool was shining with the rays of the sun, and beautiful patterns were forming. Mostly they were rhombuses with curved sides, and in motion. It was really magical, as it had always been&#8230;the power of the sun was reduced to beautiful shapes which soothed and amazed us! I touched the floor with three fingers and tried to trace out the patterns. However, soon out of breathe, I had to come up to the surface again. Now, the pool isn&#8217;t too deep. Maybe 1.5 metres or so. But, that helped to move fast from surface to surface. The water surface was sparkling as well. Then, I had an idea&#8230;something I had tried out only once during my swimming classes, where the pool is perhaps 2.5 metres deep. I used to go deep underwater, and turn about to face the surface of the water from below. This pool was not that deep, but still, it was manageable. I again took a deep breathe, and sank, and turned about, in a flat posture, like we do while we sleep. </span></i><br />\n<i><span style=\"font-family:Trebuchet MS, sans-serif;\"><br />\n</span><span style=\"font-family:Trebuchet MS, sans-serif;\">The surface was glowing. Actually, I could see the rays of the sun pouring in from the top! Now, goggles usually give a clearer sight of the water, but this was equally nice. The streaks of light were just penetrating the surface like laser beams. I was holding my nose with my fingers, because under that pressure, and in a reversed position, water easily goes into my nose. After a few seconds of eye-satisfying sights, I came to the surface again, to find that my sister had come to tell me that my parents were calling me to get up and get ready for returning back home. It was time to end the wonderful experience&#8230;</span></i><br />\n<i><span style=\"font-family:Trebuchet MS, sans-serif;\"><br />\n</span><span style=\"font-family:Trebuchet MS, sans-serif;\">You see, in a normal swimming pool, there several other swimmers wading about in the waters. Alone in a pool, the waters around you are completely calm. It feels like staying below forever. In a movie, one of the main actors had described this as addiction. He had been corrected: this is purely meditation! 🙂 I realized the truth from that day&#8217;s experience&#8230;my mind had really gone completely blank. It was only absorbing what my eyes saw. Not many days have passed, but I think this sight will always be alive in my mind. It&#8217;s absolutely vivid and clear. Maybe I&#8217;ll be able to experience this once again when I go back, but that won&#8217;t be happening for the next one year. This was the best form of refreshment I had had since a long time&#8230;</span></i></div>\n<div dir=\"ltr\" style=\"text-align:justify;\"></div>\n<div dir=\"ltr\" style=\"text-align:left;\">\n<figure id=\"attachment_671\" style=\"width: 660px\" class=\"wp-caption alignnone\"><a href=\"https://nabhoneelparchments.files.wordpress.com/2013/04/img_0063.jpg\"><img class=\"size-full wp-image-671\" src=\"https://nabhoneelparchments.files.wordpress.com/2013/04/img_0063.jpg\" alt=\"The club house of Aamar Bari project\" width=\"660\" height=\"331\" /></a><figcaption class=\"wp-caption-text\">The club house of Aamar Bari project</figcaption></figure>\n</div>\n","date":"2013-04-05T15:04:00.000Z","slug":"swimming-alone","fimg_url":false,"excerpt":"<p>The floor of the swimming pool was shining with the rays of the sun, and beautiful patterns were forming.</p>\n"},"site":{"siteMetadata":{"title":"Nabhoneel's Parchments","subtitle":"All thing photographed and written down"}}},"pageContext":{"id":"ddcdddd5-09f7-5739-95b4-fa85ffb99982"}}