{"data":{"wordpressPost":{"title":"My first experience on an airbus!","content":"<div dir=\"ltr\" style=\"text-align:left;\">\n<strong>From our Kedarnath trip:</strong><br />\nWe were lucky enough to have a flight that was also a connector flight for those going abroad. Naturally, we got an airbus. Well, when I heard of the flight number, and came to know that it was an airbus, I wasn&#8217;t actually overjoyed. All I knew was that our airlines &#8211; Air India &#8211; would surely give us refreshments.<!--more--> My uncle said that I would enjoy the experience. But, still I did not expect much. We waited for an hour at the airport.<br />\nThen the boarding started at 4:40 PM.<br />\nThe bus that took us to the aeroplane was extremely unimpressive. It had no air conditioning. Still, the expectation of refreshments on the aeroplane was something that held my attention.<br />\nThen we entered the &#8216;bus&#8217;. For the first time I saw a plane with a 2-3-2 seating arrangement. Each seat had an LCD screen behind it. I was overwhelmed at this! I sat and followed the usual procedure&#8230;<br />\nI tightened my seat belt and took a chewing gum inside my mouth (it prevents the popping of our ears). After the plane took off, I started checking out what Air India offered us &#8211; headphones (yes the ones with a soft padding), a touch interactive screen, with several applications, movies, music, games, etc., and, lots of food!<br />\nFor a short span of time, I continued to read a story on my ebook reader. The food was good. I played with the touchscreen for a while. All in all, I was pretty much occupied the whole flight 😀<br />\nIt was a nice experience 🙂\n</div>\n","date":"2012-11-13T14:06:00.000Z","slug":"my-first-experience-on-an-airbus","featured_image_src":"http://localhost:8000/wp-includes/images/media/default.png","link":"http://localhost:8000/my-first-experience-on-an-airbus/","excerpt":"<p>From our Kedarnath trip: We were lucky enough to have a flight that was also a connector flight for those going abroad. Naturally, we got an airbus. Well, when I heard of the flight number, and came to know that it was an airbus, I wasn&#8217;t actually overjoyed. All I knew was that our airlines&#8230;</p>\n"},"site":{"siteMetadata":{"title":"Nabhoneel's Parchments","subtitle":"All thing photographed and written down"}}},"pageContext":{"id":"fdb60ebc-4ddc-5b7b-9a8e-483352160a17"}}