{"data":{"wordpressPost":{"title":"My first stage&nbsp;experience!","content":"<div dir=\"ltr\" style=\"text-align:left;\">It was the 8th of April. As I woke up, only one thing was in my mind&#8230;my musical tribute.<br />\nI had created a presentation for my father(lasting for 15 minutes). It showed the different stages of my father&#8217;s life&#8230;I named it &#8216;From Innocence to Experience&#8217;, or it would be better to say-my mother named it. It contained various pictures of my father&#8217;s life from his very birth to his age of 50 years. I and my mother had secretly made it in my room in 1 month. Even the main theme of the &#8216;anushthan&#8217; (event) was unknown to everyone, including my father. About 80 people had bee invited to come to this &#8216;Musical Evening&#8217;. Earlier we used to have such musical evenings very frequently(every month, perhaps). But this was taking place after 3-4 years. So it was something that most of our invited guests were looking forward to. All of them were my father&#8217;s friends, and all of them were connected to art, either by music, or poetry, drama, what not?<br />\nI would be playing 8 musical pieces in my electronic keyboard, as the presentation continued to play. This music would be an accompaniment for the presentation.</div>\n<p><!--more--></p>\n<div dir=\"ltr\" style=\"text-align:left;\">                         After waking up, and having my breakfast and all that, I again sat in front of my synthesizer and started practicing the songs, as the presentation played on the computer screen. At 10:00 am, sharp, I went off to the hall where the &#8216;anushthan&#8217; would be taking place. I found out that the stage was quite long in width. It was some kind of momentary <span style=\"background-color:white;\">assurance&#8230;:) Anyway, I went back home again. My mother and father stayed back to make other arrangements. On my way back home, I went to the photographers(who would be covering our entire show using video and still images), and asked them to play my presentation on their laptop. It ran quite well, except for some technical difficulties, but then it was solved too. Back home, I had my lunch really early, say at 11 am, and sat to practice. I practiced for 5-6 times, so it took me one and a half hour to do it. Then, I went off to the hall once again with a laptop (borrowed from the photography team). The photographers helped me to set up the entire arrangement-the screen, the laptop and the projector. I took my electronic keyboard and set it up on the stage. I set up the special light arrangements, for playing in the dark, when the slideshow would start. The, I again played the 8 songs, to get mixed with the hall environment. But, surprisingly though, I found out that I did not feel extremely shaky. After that, the guests slowly started to come in. The sound system team was not yet there. I greeted them myself, because my father, mother and my sister were not in the hall yet. </span><br />\nBy 6:00 PM, everyone was in the hall. My mother started the evening by greeting everyone. Following that was the vocal performances by my sister and a friend of my mother.<br />\nThen, my mother announced the real reason for which all the people were called that day-the celebration of my father&#8217;s 50th birthday anniversary! Following that, all of us celebrated the event of cutting a cake (made of chocolate flavoured &#8216;mishti&#8217;), and after that, after everyone had had the piece of cake, I started my performance. When it started, I was feeling a bit heavy, but as I had decided, I became completely engrossed in what I was playing-the &#8216;Moonlight Sonata&#8217;, by Beethoven. This was the trick that helped me to cool down. Then, as the song ended, I looked up to the page in front of my (on a stand) to see which song I was to play next, and that was the moment when I had the same feeling I had when I practiced at home. The only difference was the big screen on which the slide show was being projected.<br />\nAfter that, I played the 8 tracks with the same ease, as I had while I had practicing at home! Thus, the experience was wonderful&#8230;especially when I first got my first applause! The last track that I had played was the song &#8216;Speak Softly&#8217; from the Godfather movie. So, the ending was also nice. Overall, to tell the truth, the whole experience had been wonderful-something that I will truly remember for the rest of my life!</div>\n<div dir=\"ltr\" style=\"text-align:left;\">        But there were two other things that were etched in my mind. My grandfather said to me while having dinner that night</div>\n<div dir=\"ltr\" style=\"text-align:left;\"></div>\n<blockquote>\n<div dir=\"ltr\" style=\"text-align:left;\">I was really getting bored. I had been convinced that I had a vegetable existence. I believe I was waiting for this day. Your tribute was beautiful.</div>\n</blockquote>\n<div dir=\"ltr\" style=\"text-align:left;\">And my father&#8217;s long, warm hug at home.</div>\n<div dir=\"ltr\" style=\"text-align:left;\"></div>\n","date":"2012-07-06T00:00:00.000Z","slug":"my-first-stage-experience","excerpt":"<p>It was the 8th of April. As I woke up, only one thing was in my mind&#8230;my musical tribute. I had created a presentation for my father(lasting for 15 minutes). It showed the different stages of my father&#8217;s life&#8230;I named it &#8216;From Innocence to Experience&#8217;, or it would be better to say-my mother named it. [&hellip;]</p>\n","jetpack_featured_media_url":""},"site":{"siteMetadata":{"title":"Nabhoneel's Parchments","subtitle":"All thing photographed and written down"}}},"pageContext":{"id":"ae4224f2-1211-5696-a9e0-74e3d01bd14c"}}