{"data":{"wordpressPost":{"title":"Creating Ebooks","content":"<div dir=\"ltr\" style=\"text-align:left;\">\nWhen I had attempted to gain root access to my Sony Reader, I had damaged it (when I tried to modify a code via adb, after rooting). My friend Tanmoy fixed it for me. I wanted a customized calendar app, however, as you understand, that was no longer possible. However, in the process of creating an interactive ebook, I learnt a lot. I am now capable of creating ebooks in the EPUB format!<br />\nI primarily use <em><a href=\"http://sigil-ebook.com/\">Sigil</a>, </em>however, for a more professional creation, Adobe InDesign becomes very useful. Along with that, I utilize Adobe Photoshop to create graphics.<br />\nQuite recently, I created ebooks for two of my friends &#8211; Anish and Avirup &#8211; for converting their writings into a publishable format.<br />\nAdobe InDesign is a bit complicated and requires:</p>\n<ul>\n<li>2 GB of RAM</li>\n<li>Adobe Flash Player</li>\n<li>128 MB of VRAM</li>\n<li>An (fast) internet connection</li>\n<li>1.6 GB of hard-disk space for installation, and more for other features</li>\n</ul>\n<p>Sigil, however, is a much simpler, straight-forward software, and can be used to design standard EPUB format ebooks with CSS coding as well. I think, in the future, if I do make more ebooks, it will be in Sigil, especially because it puts less load on the computer hardware 🙂\n</p></div>\n","date":"2013-03-09T09:53:00.000Z","slug":"creating-ebooks","_links":{"self":[{"href":"http://localhost:8000/wp-json/wp/v2/posts/19"}]},"excerpt":"<p>When I had attempted to gain root access to my Sony Reader, I had damaged it (when I tried to modify a code via adb, after rooting). My friend Tanmoy fixed it for me. I wanted a customized calendar app, however, as you understand, that was no longer possible. However, in the process of creating&#8230;</p>\n"},"site":{"siteMetadata":{"title":"Nabhoneel's Parchments","subtitle":"All thing photographed and written down"}}},"pageContext":{"id":"9bf79726-b4ae-5b46-970e-6251a63bdaf7"}}