{"data":{"wordpressPost":{"title":"Not Much To Say","content":"<div dir=\"ltr\" style=\"text-align:left;\">The title explains everything. Well, almost everything&#8230;:) I am a bit afraid about my studies nowadays with the load increasing with each day, and my backlog also increasing. I am actually afraid about chemistry and physics. Mathematics is going on at some progress at least. Anyway, now about my new notebook&#8230;:D My McAfee antivirus was slowly expiring. The demo version that was pre-installed, was actually a limited version of 1 month. I had started worrying about which antivirus I would get. Most of them are really costly. So, I asked some of my friends at school. They said that a genuine copy of Windows 7 has the advantage of getting a free antivirus from Microsoft called Microsoft Security Essentials. I downloaded it today, and it is working really fine. I ran a full scan of my notebook, and it detected 1 worm in my drive. So, I am satisfied with this antivirus. I have started my piano practice once again(though it is very little, maybe at night time). And, lastly, my half-yearly exams are one week away&#8230;:( 🙁 Really really frightening, especially with half of my physics syllabus still left to study. The problem is that at school our teachers finished the chapters in one hour or so, although one of our school&#8217;s most strict teachers is teaching really good. She is going steadily. Anyway, that&#8217;s it for today, that is for now&#8230;because tomorrow my school is closed! 😀 Tomorrow, I&#8217;ll probably blog again. Oh! And one more thing. I have been learning some encryption algorithms lately, although I cannot understand any of them. Data Encryption Standard 128-bit encryption is good. And that&#8217;s as far as I will go. Advanced Encryption System is tooooooooooooooo tough. Hehehe&#8230;that&#8217;s all!<br /> Bye!</div>\n","date":"2012-08-08T14:44:00.000Z","slug":"not-much-to-say","fimg_url":false,"excerpt":"<p>The title explains everything. Well, almost everything&#8230;:) I am a bit afraid about my studies nowadays with the load increasing with each day, and my backlog also increasing. I am actually afraid about chemistry and physics. Mathematics is going on at some progress at least. Anyway, now about my new notebook&#8230;:D My McAfee antivirus was&#8230;</p>\n"},"site":{"siteMetadata":{"title":"Nabhoneel's Parchments","subtitle":"All thing photographed and written down"}}},"pageContext":{"id":"0784dafc-27a9-5af2-a9c3-cbb2634ac324"}}