{"data":{"wordpressPost":{"title":"A Journey Into The Jungle","content":"<div dir=\"ltr\"><a href=\"https://nabhoneelparchments.wordpress.com/2014/10/14/a-journey-into-the-jungle/\"><img class=\"aligncenter wp-image-344 size-large\" src=\"https://nabhoneelparchments.files.wordpress.com/2014/10/img_13551.jpg?w=660\" alt=\"IMG_1355\" width=\"660\" height=\"371\" /></a></div>\n<div dir=\"ltr\">\nI&#8217;ll be listing the three extraordinary memories of our trip to Uttarakhand.<br />\nThe first one was a jungle safari&#8230;<br />\nHowever, let me first give you a gist of the places we visited before the jungle safari.<!--more--><br />\nOur trip started from Rishikesh, a place near Haridwar.</p>\n<div><img class=\" aligncenter\" src=\"https://nabhoneelparchments.files.wordpress.com/2014/10/blog11.png?w=660\" alt=\"blog1\" width=\"660\" height=\"390\" /></div>\n<div></div>\n<div>From Rishikesh, we went to Chilla. Rajaji National Park is located in Chilla, and we stayed in GMVN resorts all along, so getting a jeep for the jungle safari was not a problem at all. However, the problem was the time. The core area remains closed  till the 15th of November. So, there was no way we could actually see wild animals. We were only taken to the buffer zone.</div>\n<div>This was the first time I would be riding an open jeep. I was pretty excited when the jeep arrived&#8230;</div>\n<p><img class=\" aligncenter\" src=\"https://nabhoneelparchments.files.wordpress.com/2014/10/img_12391.jpg?w=660\" alt=\"IMG_1239\" width=\"660\" height=\"440\" /></p>\n<div></div>\n<div></div>\n<div>&#8230;and so were the others!</div>\n<div></div>\n<div>Then the journey started. The jeep blazed through the road beside the canal that was created by trapping water from the Chandrabhaga. As the jeep blazed through the road and the wind gushed past my face, it felt refreshing! I tried to take several photos but most got blurred. However, I like this particular photo&#8230;the blur brings out the motion!</div>\n<div></div>\n<div><img class=\" aligncenter\" src=\"https://nabhoneelparchments.files.wordpress.com/2014/10/img_12501.jpg?w=660\" alt=\"IMG_1250\" width=\"660\" height=\"372\" /></div>\n<div></div>\n<div>After a while, we spotted the first animal&#8230;</div>\n<div></div>\n<div>\n<figure style=\"width: 660px\" class=\"wp-caption aligncenter\"><img src=\"https://nabhoneelparchments.files.wordpress.com/2014/10/img_12651.jpg?w=660\" alt=\"IMG_1265\" width=\"660\" height=\"371\" /><figcaption class=\"wp-caption-text\">One of the times I understood the advantages of my telephoto lens</figcaption></figure>\n</div>\n<div></div>\n<div>&#8230;on the other side of the canal.</div>\n<div>Anyway, after that, the jeep journey continued. After a few minutes, I was starting to think the whole road was actually the buffer-zone. We then diverted into a muddy path that led into the forest!</div>\n<div></div>\n<div><img class=\" aligncenter\" src=\"https://nabhoneelparchments.files.wordpress.com/2014/10/img_12781.jpg?w=660\" alt=\"IMG_1278\" width=\"660\" height=\"373\" /></div>\n<div></div>\n<div>This was thrilling, especially when we arrived at a certain point, that was surrounded by forests on three side, and a hill slope on one side. There was silence. Complete silence. And the occasional sounds of certain insects. But, sometimes, we could hear some low rumbling noises. The silence was deafening&#8230;</div>\n<div></div>\n<div><img class=\" aligncenter\" src=\"https://nabhoneelparchments.files.wordpress.com/2014/10/img_13321.jpg?w=660\" alt=\"IMG_1332\" width=\"660\" height=\"372\" /></div>\n<div></div>\n<div>We could go back only by the way we had came.</div>\n<div>When we reached the main road again, it was slightly darker. We then progressed through the road until we came to another muddy road that led into the jungle. We first went through a village and then moved deeper. The path was slightly uphill.</div>\n<div>        We saw two peahens on the way.</div>\n<div></div>\n<div>\n<figure style=\"width: 660px\" class=\"wp-caption aligncenter\"><img src=\"https://nabhoneelparchments.files.wordpress.com/2014/10/img_13401.jpg?w=660\" alt=\"IMG_1340\" width=\"660\" height=\"372\" /><figcaption class=\"wp-caption-text\">A Peahen</figcaption></figure>\n</div>\n<div></div>\n<div>That was the last animal we saw. Usually, if one goes to the core area, an elephant is ALWAYS visible.</div>\n<div>        We simply traveled deeper. After a certain point, it was getting really dark. We had to turn back. The driver drove a bit faster than before. This journey was amazing!</div>\n<div>        It was mystical! The cool, moist air, filled with oxygen traveled into our lungs and rejuvenated us&#8230;</div>\n<div>        Apart from that, as we moved on, a certain central area would become visible from time to time. This is something that has been etched in my mind. It was simply a collection of trees that formed a canopy at the top, but whose lower portions could not be seen. In other words, from a moving vehicle, we could never realize the depth of that region! And the trees continued on and on. I tried to capture this, but we were moving fast, and it was really dark. Still, I got this, but one can&#8217;t realize what we saw from this picture:</div>\n<div></div>\n<div><img class=\" aligncenter\" src=\"https://nabhoneelparchments.files.wordpress.com/2014/10/img_13551.jpg?w=660\" alt=\"IMG_1355\" width=\"660\" height=\"371\" /></div>\n<div></div>\n<div>As we progressed towards our resort by the main road, I plugged in my earphones and played a few songs that would match the atmosphere. I&#8217;ll tell you exactly what I did. I listened to Arwen&#8217;s Vigil, by The Piano Guys, kept my camera beside me, and lay my head flat on the backrest. The chilly ear, the tone of the piano and the strings &#8211;  these contributed to a feeling that was limitless!</div>\n<div></div>\n<div>         We stopped at a small tea shop before going to our hotel. The tea shop was located adjacent to the core area, and the walls were filled with paintings of the forest. Snacks, and even some forest-gear was on sale!</div>\n<div>\n<figure style=\"width: 660px\" class=\"wp-caption aligncenter\"><img src=\"https://nabhoneelparchments.files.wordpress.com/2014/10/img_13911.jpg?w=660\" alt=\"IMG_1391\" width=\"660\" height=\"372\" /><figcaption class=\"wp-caption-text\">Hot tea and chips tasted fantastic after the journey!</figcaption></figure><br />\n<img class=\" aligncenter\" src=\"https://nabhoneelparchments.files.wordpress.com/2014/10/img_13881.jpg?w=660\" alt=\"IMG_1388\" width=\"660\" height=\"372\" /></div>\n</div>\n<hr />\nRead up the next post &#8211; <a title=\"When we went to Landour…\" href=\"https://nabhoneelparchments.wordpress.com/2014/11/06/when-we-went-to-landour/\" target=\"_blank\">When We Went to Landour&#8230;</a> &#8211; for the third experience of our Uttarakhand trip</p>\n","date":"2014-10-14T09:42:00.000Z","slug":"a-journey-into-the-jungle","excerpt":"<p>But, sometimes, we could hear some low rumbling noises. The silence was deafening…</p>\n"},"site":{"siteMetadata":{"title":"Nabhoneel's Parchments","subtitle":"All thing photographed and written down"}}},"pageContext":{"id":"7567e9a4-2077-5556-a354-f3c6bd4b3e1e"}}