{"data":{"wordpressPost":{"title":"Website making: Part 3","content":"<div dir=\"ltr\" style=\"text-align:left;\">\n<p style=\"text-align:justify;\"><span style=\"font-family:comic sans ms;\">Continued from: &#8216;<a title=\"Website making: Part 2\" href=\"http://nabhoneelparchments.wordpress.com/2012/12/19/website-making-part-2/\">Website making: Part 2</a>&#8216; and before that, &#8216;<a title=\"Website Making: Part 1\" href=\"http://nabhoneelparchments.wordpress.com/2012/12/17/website-making-part-1/\">Website making: Part 1</a>&#8216;</span></p>\n<p style=\"text-align:justify;\"><span style=\"font-family:comic sans ms;\">The shock! Our school also had another team. They had brought a website a few days back which they had designed not by programming but by using MS FrontPage. Thus, it had lacked the modern features like CSS, and looked a bit like Avirup&#8217;s &#8216;Government Website&#8217;. But, that day, they were desperate for flash technology. On the day of the competition, on the 7th, they brought something that brought our eyes out. <!--more-->He had a 3D VIDEO GALLERY! And a 3D PHOTO GALLERY as well! We lost hope. The only thing that we had was huge information, simplicity, and a user-friendly navigation system.<br />\nDuring the competition, the judge asked us various questions which Avirup answered smartly. He has a VAST range of knowledge about various things, and the previous night he had researched our topic. Avirup&#8217;s answers satisfied the judge. He was really impressed. I told him about the technologies which we had used: HTML5, HTML, JavaScript, CSS, Java Applets. At the end of our session, he looked at our masthead. I had made a section called &#8216;About the website&#8217;, where I had included all the information sources. This was our savior. This is where the other team got beaten. Yeah, our info, and design were also an advantage&#8230;the navigation bar which linked to each and every page was another savior. But, the judge did say that by not referring to their information sources, they had violated copyrights. In the end, we did win. I had become quite doubtful then, because of their fantastic layout. But, I was satisfied with my work, and had made myself ready to accept the loss as well (but, yes&#8230;had we lost, I would have been deeply grieved. The hard work would have all gone to vain).<br />\nI have learnt a lot about the internet, and of course about website designing and HTML, CSS, JavaScript coding from this project. That&#8217;s what I am happy for, apart from the competition&#8230;</span></p>\n</div>\n","date":"2012-12-19T13:32:00.000Z","fimg_url":false},"site":{"siteMetadata":{"title":"Nabhoneel's Parchments","subtitle":"All thing photographed and written down"}}},"pageContext":{"id":"099ae931-5fbf-5690-8148-c679b17b745c"}}