{"data":{"wordpressPost":{"title":"Common yet my own 2012","content":"<div dir=\"ltr\" style=\"text-align:left;\"><span style=\"font-family:Century Gothic;\">The year that left us&#8230;a common topic.<br />\nThis was the most common topic in Facebook. Everyone posted their own collection of memories in Facebook through status updates, pictures, notes, etc. That&#8217;s why blogging is kind of useful to me. One thing I know for certain. My list might go too long, and no one will care to read through the entire post. That&#8217;s why blogging is much better. I can freely list myself here. Anyway, let&#8217;s move on&#8230;<!--more--><br />\nJanuary: I won&#8217;t go on listing like this, but still, it&#8217;s a good option for starting. The year started with our class 10 selection tests. Only one term can describe our school&#8217;s selection tests for both class 10 and 12: horrible. No description needed for that.<br />\nThen, the rest of January and February was spent in preparing for our first board examinations: the ICSEs. It was truly a tough time. People say that scoring is easy in ICSE, but those two months require some amount of hard work. Anyway, after that, in the end of February, the exams started. In January many of use had given mock tests in different centres, although I hardly know how much that helped us 😀<br />\nThe month of April was a unique one. Right after my boards ended on the 26th of March, I escaped to our house in Shantiniketan with my parents. A five day trip, it is still the longest stay that we have had. On returning, I started heavy practice for playing with the presentation that I had made for my father&#8217;s 50th birthday anniversary. That was my first stage experience. And, it was quite satisfactory.<br />\nApril was quite eventful. Our ICSE results would come out on the 19th. That day was the most tense and yet enjoyable day. At first it was filled with tension. When the results came out at 3pm, tension was replaced with joy!<br />\nThen started the class 11 rush. Although it had already started I didn&#8217;t pay much attention at first. Then, as the humongous syllabus slowly unwrapped itself, I came to know that I had start studying. However, the half yearly examinations were really poor for most of me and my friends. The effect quickly wore off (temporarily) as the pujas arrived, and so did our trip to Kedarnath. Photography was quite satisfactory, although I believed it wasn&#8217;t really good enough. When we had went to Mandarmoni or Shantiniketan, I had been more satisfied. Anyway, after that in the month of December came the best experience &#8211; website designing!<br />\nChristmas wasn&#8217;t really special, and neither was New year. However, dryly said, this was my list of memorable events that took place during the year 2012. Oh! And I forgot to mention doomsday 😀 </span></div>\n<div dir=\"ltr\" style=\"text-align:left;\"><span style=\"font-family:Century Gothic;\">The biggest hoax of the year!</span></div>\n<div dir=\"ltr\" style=\"text-align:left;\"></div>\n<div dir=\"ltr\" style=\"text-align:left;\"><span style=\"font-family:Century Gothic;\">And there was the Delhi rape case, something that shook us from our very insides and showed us what we &#8216;civilized&#8217; people could do &#8211; a memory that will remain a smear on the face of India forever&#8230;</span></div>\n<div dir=\"ltr\" style=\"text-align:left;\"><span style=\"font-family:Century Gothic;\"><br />\nSo sum up like an essay, this was my list of 2012 events.</span></div>\n","date":"2013-01-03T19:28:00.000Z","slug":"common-yet-my-own-2012","fimg_url":false,"excerpt":"<p>The year that left us&#8230;a common topic. This was the most common topic in Facebook. Everyone posted their own collection of memories in Facebook through status updates, pictures, notes, etc. That&#8217;s why blogging is kind of useful to me. One thing I know for certain. My list might go too long, and no one will&#8230;</p>\n"},"site":{"siteMetadata":{"title":"Nabhoneel's Parchments","subtitle":"All thing photographed and written down"}}},"pageContext":{"id":"d35763f6-6a36-5b91-8cf6-9fd7e8c93147"}}