{"data":{"wordpressPost":{"title":"Music &#8211; The Soul Companion","content":"<div dir=\"ltr\" style=\"text-align:left;\">This post is mainly to describe what music I like. My parents helped me develop a good taste of music since I was a child. I liked Rabindranath Tagore&#8217;s music, some Bengali bands&#8217; music, and some English movies&#8217; songs, including some serials. When I was studying in 8th grade, one of my best friends first introduced me to Western pop music, and also rock music. He gave me a pen drive full of such songs. Initially I liked most of them. In fact, they were outweighing my previous taste of music. I loved the rock songs of Linkin Park, then the soft rock music of the Eagles, songs of a band called Evanescence, and so on. And, in order to reveal the truth, I was a bit proud to hear and like such songs. This culture of music stayed on with me for 2 years. However, I had not completely stopped listening to Indian music, I still liked Rabindranath Tagore&#8217;s songs, and some other songs, but my taste had changed and I knew that. For some time, I began listening to songs of contemporary Bengalis, who actually experimented with various types of musical compositions. Their album was called &#8216;Back To The Future&#8217;.<br />\nThen, I had a drastic change. <!--more-->I started listening to Western classical music all of a sudden. My favourites were compositions of Beethoven. I had also started to play the synthesizer from class 8 (mid term). So, all these types of music greatly appealed to me.<br />\nBut, slowly I realized that I did not actually listen to these songs for the purpose of listening to music. I just liked listening to them. They were pleasant to the ear. That&#8217;s why I liked them.<br />\nThen something happened. My father is surrounded by a large number of people who are very much linked with musical lines of profession. Even he is a wonderful singer. One of my father&#8217;s friends came to our house one day, mainly to do some official stuff, but he also brought with him a DVD-video of Yanni-Live at the Acropolis. I had heard of Yanni&#8217;s name from my grandfather because my aunt used to listen to Yanni too, in fact she still listens a lot. After my father&#8217;s friend went back home, I played the DVD on our portable DVD player. Quite surprisingly, I skipped on to the 3rd song of the album-Until The Last Moment. And that was the most enchanting moment I had ever had! The song was pure and captivating&#8230;</div>\n<div dir=\"ltr\" style=\"text-align:left;\">After that, I listened to all the songs. But that song had had a special effect. It was truly magical.<br />\nThat was the second, and biggest turning point in my taste of music. I came to know which genre&#8217; of music would appeal to me most, and would give me the actual joy of listening to music. Everyone around me used to say that Rabindranath Tagore&#8217;s songs can uplift a man, and can give consolation at any time. I used to like his songs(and I still do), but Yanni&#8217;s music was certainly special, because I didn&#8217;t have to make any effort to have that special feeling which people have to do while listening to Tagore&#8217;s songs-they have to decipher the special meanings of the lyrics of his songs. Yes, this is a big proof of my laziness, but Yanni&#8217;s music is certainly much more appealing to me. His songs are termed as Contemporary Instrumental by some, or New Age, by some people. Whatever be the name of the genre&#8217;, I had finally found a sink for all types of emotions. His songs can help me when I am too happy, or sad, or I am suffering from something&#8230;.practically everything!<br />\nAlthough I have never actually been to any of his live performances, because most of them take place outside India (he played one concert in India, in 1993, and that album was called Tribute), but till I really look forward to that day when I will be able to listen to him playing live.<br />\nA good word to describe his songs would be &#8216;magical&#8217;. He really does have a magical way of composing songs that are best suited to a place. For example, when he played the concert in front of the Taj Mahal, in India, he created such an enchanting environment in the whole place(where he was playing), that I even got absorbed into his music by the seeing the DVD video.<br />\nWell, that&#8217;s it for today. My half yearly exams are going to start next week only, and as I have probably mentioned before, a huge part of my syllabus is still left. Signing off!</div>\n"},"site":{"siteMetadata":{"title":"Nabhoneel's Parchments","subtitle":"All thing photographed and written down"}}},"pageContext":{"id":"724f15ef-f323-50f5-9ee1-820331e892b1"}}