{"data":{"wordpressPost":{"title":"New Notebook","content":"<div dir=\"ltr\">\n<p style=\"text-align:justify;\">My new notebook has arrived! Now I am blogging from the notebook itself! We went to the airport to bring my aunt and my brother today. We didn&#8217;t even have to wait for long&#8230;perhaps 10 minuted or so. I spent that time reading the Kite Runner. Anyway, just when the flight had arrived we went up to the conveyor belt, and we found them waiting to collect their bags! We waived our hands frantically just to make them see us. That is the moment that I enjoy the most whenever they arrive here. After they came home, Kundan(my brother) went to my room and quickly popped out the new Dell Notebook Inspiron! <!--more-->I was really amazed at the sight! I read the configuration of the notebook, and that was amazing too! Here&#8217;s the configuration:</p>\n<ul>\n<li style=\"text-align:justify;\">500 GB hard disk</li>\n<li style=\"text-align:justify;\">4 GB RAM</li>\n<li style=\"text-align:justify;\">Intel integrated graphics(1696 MB)</li>\n<li style=\"text-align:justify;\">Windows 7 Genuine Home Premium (64 bit)</li>\n<li style=\"text-align:justify;\">Intel Core i3 2nd Generation</li>\n<li style=\"text-align:justify;\">15.6&#8243; widescreen LED display with 1366 x 768 resolution</li>\n</ul>\n<div style=\"text-align:justify;\"></div>\n<div style=\"text-align:justify;\">When I booted the notebook for the first time, it asked me to enter some basic details. However, after I started it up, the machine was a bit slow. Even copying files took some time. But now, it is filled with pure awesomeness! I can actually use widgets, and other desktop tools too! I can use Microsoft products, and the Inspiron even has the Microsoft Word 2010 Starter Kit loaded in it!!! I had feared earlier that I would face some problem in typing. But now as I am typing out my excitement, I am finding no difficulty at all! On the contrary, it is really comfortable, as I can rest my hand on the wide space and then type. My Java is working fine, But I have to install some more things before I can actually be friendly with this computer.</div>\n<div style=\"text-align:justify;\"></div>\n<div style=\"text-align:justify;\">Oh! I almost forgot! My aunt also brought with her the original cover for my Sony Reader PRS T1! It&#8217;s great too! The cover also has an integrated lighting system, and Sony claims that the light will last up to 19 hours. But, the cover does not have anything to strap it down. But, I am extremely happy, that the Reader is now absolutely secure, and tight inside the case, with no jerking at all. The only problem is that I can&#8217;t keep my stylus inside it. But, still, it&#8217;s great! My next excitement is that we will be going to Shantiniketan again!!! For two days. Till then, I still have to spend a whole week at school&#8230;:D And, the boring fact is that, I have to prepare for my computer exam tomorrow. And, I also have to study Chemistry for my tutorial class tomorrow. Well, I guess I have to accept that. Now, I just hope that I get respectable marks in my computer examination tomorrow.</div>\n<div style=\"text-align:justify;\"></div>\n</div>\n","date":"2012-07-15T10:01:00.000Z","slug":"new-notebook","excerpt":"<p>My new notebook has arrived! Now I am blogging from the notebook itself! We went to the airport to bring my aunt and my brother today. We didn&#8217;t even have to wait for long&#8230;perhaps 10 minuted or so. I spent that time reading the Kite Runner. Anyway, just when the flight had arrived we went&#8230;</p>\n","better_featured_image":{"source_url":"http://localhost:8000/wp-content/uploads/2014/12/dell_inspiron_n50502nd_50507916-1.jpg"}},"site":{"siteMetadata":{"title":"Nabhoneel's Parchments","subtitle":"All thing photographed and written down"}}},"pageContext":{"id":"29f27d97-db68-5eff-afe6-85201ae7a971"}}